const mongoose = require('mongoose');
const { MONGO_URL } = require('config');
console.log('1. MONGO_URL = ', MONGO_URL);
const { FIRST, NONFIRST } = require('./constants');
const statementModel = require('./models/statementModel');

mongoose.Promise = global.Promise;

const firstSentences = [
  'आज का दिन मानसिक तनाव देने वाला होगा।',
  'आपके लिए आज का दिन अच्छा रहेगा।',
  'आज का दिन आपके लिए सामान्य रहेगा।',
  'आज का दिन अच्छा रहेगा।',
  'आज का दिन सावधानीपूर्वक रहने का दिन है।',
  'आपके लिए आज का दिन सामान्य रहेगा।',
  'आज का दिन थोड़ा कमजोर रहेगा।',
  'आपके लिए आज का दिन सामान्य नतीजे लेकर आएगा।',
  'आज का दिन मिलाजुला रहेगा।',
  'आज का दिन सामान्य रहेगा।',
  'आज का दिन आपके लिए अच्छा होगा।',
  'आपके लिए आज का दिन अच्छा रहेगा।'
];

const sentences =
  'खर्चों से आप परेशान होंगे। स्वस्थ्य में थोड़ा सुधार होगा। अधिक ठंडी प्रकृति की वस्तुओं का सेवन ना करें इससे कफ की दिक्कत हो सकती है। काम के सिलसिले में स्थितियां आप के पक्ष में होंगी। अपने काम से काम रखें और दूसरों के काम में हाथ ना डालें। यात्रा के दौरान सावधानी बरतें। आपके प्रिय से संबंध बिगड़ सकते हैं। शादीशुदा जातकों का दांपत्य जीवन अच्छा रहेगा और आपके परिवार में सुख रहेगा।' +
  'इनकम बढ़िया रहने वाली है। परिवार में भी आपसी प्रेम बढ़ेगा। शादीशुदा जातकों के दांपत्य जीवन में दिक्कतें आएंगी। जीवन साथी का स्वास्थ्य भी खराब रहेगा। प्यार के मामलों में आपको सावधानी से काम लेना चाहिए। किसी अन्य व्यक्ति के हस्तक्षेप से आपको दिक्कतों का सामना करना पड़ सकता है। काम के सिलसिले में आज का दिन कमजोर रहेगा।' +
  'काम के सिलसिले में अच्छा समय रहेगा। मन लगाकर काम करेंगे तो आपको अच्छे नतीजे हासिल होंगे। सुख सुविधाओं के कारण खर्चा ज्यादा होगा जिससे मन दुखी हो सकता है। शारीरिक रूप से किसी दिक्कत से परेशान हो सकते हैं। कोई चोट या पेट दर्द हो सकता है। शादीशुदा लोगों के दांपत्य जीवन के लिए दिन सामान्य रहेगा। प्रेम जीवन जीने वाले लोगों के प्रेम जीवन में उथल पुथल मच सकती है।' +
  'खर्चों में कटौती होगी और धन का लाभ होगा। काम के सिलसिले में नए अवसरों की खोज करेंगे। आज कहीं से नौकरी का आवेदन स्वीकार हो सकता है और जॉब के लिए इंटरव्यू कॉल आ सकती है। आप अपने विरोधियों को हरा देंगे। परिवार में प्रेम बना रहेगा। आपकी माँ जी का आशीर्वाद और सहयोग प्राप्त होगा। व्यापार के लिए आज का दिन बढ़िया है।' +
  'स्वास्थ्य से संबंधित दिक्कतें हो सकती हैं। शिक्षा में मन कम लगेगा। यदि आप किसी से प्रेम करते हैं तो आज चुनौती का सामना करना पड़ेगा। अपने किसी दोस्त को अपने प्रेम जीवन में हस्तक्षेप ना करने दें। पारिवारिक जीवन में थोड़ा तनाव रहेगा हालांकि जो लोग शादीशुदा हैं उनका दांपत्य जीवन बढ़िया रहेगा। ऑफिस में किसी से झगड़ा हो सकता है।' +
  'आप अपने जीवन साथी पर पूरा ध्यान देंगे और उनकी बातें भी सुनेंगे। इससे आपका दांपत्य जीवन खुशनुमा रहेगा। कारोबार में आज उन्नति का दिन है। आपकी कई योजनाएं सफल होंगी और आपको खुशी भी होगी। परिवार वालों का स्वास्थ्य आपको परेशान करेगा। यदि किसी से प्रेम करते हैं तो प्रेम जीवन में आज अच्छे डीजे हासिल होंगे। उनसे अपने मन की बात जरूर कहें।' +
  'खर्चों में बढ़ोतरी रहेगी। अपने भोजन में अधिक मसालों का प्रयोग ना करें, वर्ना आपका स्वास्थ्य खराब हो सकता है। माँ जी से आपको सुख मिलेगा। परिवार में खुशी रहेगी। परिवार के छोटों को कोई दिक्कत हो सकती है। यात्रा पर जाने के लिए आज का दिन अच्छा नहीं है। प्रेम जीवन में खुशी के पल आएंगे और आप अपने दोस्तों के साथ कोई पार्टी कर सकते हैं। दांपत्य जीवन के लिए दिन सामान्य रहेगा। काम के सिलसिले में आज का दिन बढ़िया रहेगा।' +
  'प्रेम जीवन में सफलता मिलेगी। यदि आप शादीशुदा हैं तो दिन अच्छा रहेगा। वाहन सावधानी से चलाएं। परिवार में किसी बात को लेकर माहौल गर्म होगा जिससे आपको परेशानी होगी। अपने खाने पीने पर पूरा ध्यान दें। स्वास्थ्य बिगड़ सकता है। आनंददायक यात्रा हो सकती है। उनके मामले में आज का दिन सामान्य रहेगा।' +
  'परिवार वालों का सहयोग मिलेगा। काम के सिलसिले में परिवार वालों के सहयोग से कई काम बनेंगे। शादीशुदा लोगों के दांपत्य जीवन में भी दिन बढ़िया रहेगा और जीवनसाथी से दूरी कम होगी। खर्चे काफी होंगे। स्वास्थ्य बिगड़ सकता है। यदि किसी से प्रेम करते हैं तो उन्हें अपने मन की बातें जरूर बताएं। आज कोई विशेष भोजन खाने को मिल सकता है जिससे आपको संतुष्टि और खुशी होगी।' +
  'यात्रा पर जाने में मजा आएगा। कारोबार के सिलसिले में की गई यात्रा सफलता देगी। आपके खर्चे बहुत अधिक होंगे फॉरेन से आपकी आर्थिक स्थिति बिगड़ सकती है। आपके मन में एक साथ बहुत सारे काम होंगे जिन्हें पूरा करना आपके लिए जरूरी होगा। इनकम में भी वृद्धि होगी। प्रेम जीवन में तनाव बना रहेगा। आपके परिवार वालों का पूरा सहयोग रहेगा।' +
  'परिवार में भी खुशियां रहेंगी और काम के मामले में भी आपको अच्छे नतीजे हासिल होंगे। आपके खर्चे बने रहेंगे लेकिन इनकम बढ़ाने का कोई जरिया मिल सकता है। प्रेम जीवन जीने वाले लोगों के लिए आज का दिन बहुत बढ़िया रहेगा। उनके प्रिय से संबंध सुधरेंगे। शादीशुदा लोगों के दांपत्य जीवन में तनावपूर्ण स्थितियाँ आ सकती हैं।' +
  'आप मानसिक रूप से बहुत मजबूत रहेंगे। इससे हर काम को बहुत अच्छे तरीके से करेंगे और आपको आनंद आएगा। शादीशुदा लोगों के दांपत्य जीवन में जीवनसाथी का सहयोग मिलेगा। खुशियों में बढ़ोतरी होगी। आपकी कोई पुरानी इच्छा पूरी हो सकती है जिससे आपका मन हर्षित होगा। परिवार का माहौल खुशनुमा रहेगा। प्रेम जीवन जीने वाले लोगों के जीवन में भी खुशी भरे पल आएंगे। परिवार के किसी गुर्जर का स्वास्थ्य बिगड़ सकता है।';

const firstSentenceData = firstSentences.map((sent) => ({
  text: sent,
  position: FIRST
}));

const nextSentenceData = () => {
  let sentanceArray = sentences.split('। ');
  return sentanceArray.map((sentan) => ({
    text: sentan + '।',
    position: NONFIRST
  }));
};

// const zodiacSigns = 'Aries (Ram)\
// (मेष)\
// \
// Taurus (Bull)\
// (वृषभ)\
// \
// Gemini (Twins)\
// (मिथुन)\
// \
// Cancer (Crab)\
// (कर्क)\
// \
// Leo (Lion)\
// (सिंह)\
// \
// Virgo (Virgin)\
// (कन्या)\
// \
// Libra (Scales)\
// (तुला)\
// \
// Scorpio (Scorpion)\
// (वृश्चिक)\
// \
// Sagittarius (Archer)\
// (धनु)\
// \
// Capricorn (Goat)\
// (मकर)\
// \
// Aquarius (Pitcher)\
// (कुंभ)\
// \
// Pisces (Fish)\
// (मीन)'

// const testData = [
//   {
//     text: 'आज का दिन मानसिक तनाव देने वाला होगा।',
//     position: NONFIRST
//   }
// ];

mongoose.connect(MONGO_URL).then((db) => {
  statementModel
    .remove({})
    .then(() => statementModel.insertMany(firstSentenceData))
    .then(() => statementModel.insertMany(nextSentenceData()));
});
